Практос_2/src/Documents/Договор/Договор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Договор</name>
  <registerRecords>AccumulationRegister.ПоступленияДС</registerRecords>
  <attributes>
    <name>Оргнанизация</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоговора</name>
    <type>
      <types>DefinedType.Рубли</types>
    </type>
  </attributes>
</mdclass:Document>

Практос_2/src/AccumulationRegisters/ПоступленияДС/ПоступленияДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПоступленияДС</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Рубли</types>
    </type>
  </resources>
  <attributes>
    <name>СписаниеСредствНаПодбор</name>
    <type>
      <types>DocumentRef.СписаниеСредствНаПодбор</types>
    </type>
  </attributes>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>DocumentRef.Договор</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Практос_2/src/Documents/Договор/ObjectModule.bsl
Процедура обработкаПроведения(Отказ, режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПоступленияДС Приход
	Движения.ПоступленияДС.Записывать = Истина;
	Движение = Движения.ПоступленияДС.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Договор = Ссылка;
	Движение.Сумма = СуммаДоговора;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
 КонецПроцедуры
